Revit 2027 API
DirectShapeType.AreOptionsValid Method
 Validates that the given DirectShapeTypeOptions are allowed for this particular DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreOptionsValid(
	DirectShapeTypeOptions options
)
Public Function AreOptionsValid (
	options As DirectShapeTypeOptions
) As Boolean
public:
bool AreOptionsValid(
	DirectShapeTypeOptions^ options
)
member AreOptionsValid :
        options : DirectShapeTypeOptions -> bool
Parameters
options DirectShapeTypeOptions
 The options object.
Return Value
Boolean
 True if the DirectShapeTypeOptions are valid; false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace